import { ClassId, Variant, WorkItem } from '@/types';

export const works: Record<ClassId, Record<Variant, WorkItem>> = {
  6: {
    1: {
      class_id: 6,
      variant: 1,
      workType: 'Діагностувальна контрольна робота',
      title: 'Раціональні числа та дії над ними',
      tasks: [
        `<p>1. Якою стала температура повітря зранку, якщо ввечері вона була −6,5°C, а за ніч знизилася на 2,8°C?</p>
<p>А) 3,7°C &nbsp; Б) −9,3°C &nbsp; В) −3,7°C &nbsp; Г) 9,3°C</p>`,
        '2. Розкрийте дужки та спростіть вираз: \n(6y − 8) + 7',
        '3. Розкрийте дужки та спростіть вираз: \n−d − (h + s − b)',
        '4. Розкрийте дужки та спростіть вираз: \n(7b − 4) − (4b + 2)',
        '5. Розкрийте дужки та спростіть вираз: \n−(5n + m) + (n + 8m) − (7m − 5n)',
        '6. Розкрийте дужки та спростіть вираз: \n4 + (−7x + 5)',
        '7. Розкрийте дужки та спростіть вираз: \n−(y − a) + 7',
        '8. Розкрийте дужки та спростіть вираз: \n−d − (−h − s − b)',
        '9. Розкрийте дужки та спростіть вираз: \n(2a − 3) − (−a − 16)',
      ],
    },
    2: {
      class_id: 6,
      variant: 2,
      workType: 'Діагностувальна контрольна робота',
      title: 'Раціональні числа та дії над ними',
      tasks: [
        '1. Розкрийте дужки та спростіть вираз: \ny − (−8 + 7y)',
        '2. Розкрийте дужки та спростіть вираз: \n−(2 − 5x) + 12',
        '3. Розкрийте дужки та спростіть вираз: \nc + (−x − p − 7c)',
        '4. Розкрийте дужки та спростіть вираз: \n(c − 5d) − (5c − d)',
        '5. Розкрийте дужки та спростіть вираз: \n(5x + y) − (−2y + 4x) + (7x − 3y)',
        '6. Розкрийте дужки та спростіть вираз: \n−(−x − 2) + (x − 1)',
        '7. Розкрийте дужки та спростіть вираз: \ny − (−8 + y)',
        '8. Розкрийте дужки та спростіть вираз: \n−(2 + 5x) − 12',
        '9. Розкрийте дужки та спростіть вираз: \nc + (x − p + 7c)',
      ],
    }
  },

  7: {
    1: {
      class_id: 7,
      variant: 1,
      workType: 'Самостійна робота',
      title: 'Лінійні рівняння та графіки функцій',
      tasks: [
        '1. Чи є розв’язком рівняння \nx − y = 5 пара чисел: \nа)(6;0), б)(7;2), в)(4;−1)?',
        '2. Графік якого з рівнянь проходить \nчерез точку A(3;−2): \nа)2x − y = 6, \nб)4x + 5y = 2, \nв)3x − y = 5, \nг)0,2x − 0,5y = −1,6',
        '3. Виразіть з рівняння \nx − 7y = 5 змінну x через y.',
        '4. Виразіть з рівняння \n4x − y = 7 змінну y через x.',
        '5. Виразіть з рівняння \n2x + 5y = 3 змінну x через y.',
        '6. Побудуйте графік функцій: \nx − y = 2 та 3x + y = 1.',
      ],
    },
    2: {
      class_id: 7,
      variant: 2,
      workType: 'Самостійна робота',
      title: 'Лінійні рівняння та графіки функцій',
      tasks: [
        '1. Чи є розв’язком рівняння \nx − y = 7 пара чисел: \nа)(8;1), б)(7;2), в)(4;−3)?',
        '2. Графік якого з рівнянь проходить \nчерез точку A(2;1): \nа)2x − y = 6, \nб)4x − 5y = 1, \nв)3x − y = 5, \nг)0,2x − 0,5y = −1,6',
        '3. Виразіть з рівняння \nx + 6y = 3 змінну x через y.',
        '4. Виразіть з рівняння \n2x − y = 13 змінну y через x.',
        '5. Виразіть з рівняння \n2x − 5y = 9 змінну x через y.',
        '6. Побудуйте графік функцій: \nx + y = −2 та 2x + y = 1.',
      ],
    }
  },

  10: {
    1: {
      class_id: 10,
      variant: 1,
      workType: 'Самостійна робота',
      title: 'Основні правила диференціювання функцій',
    tasks: [
      'Обчисліть значення функції \nf(x) = 3x³ + 2 в точці x₀ = 1.',
      'Знайдіть похідну функції \ny = 3x − sin x.',
      'Укажіть похідну функції \ny = 3x² + tg x.',
      'Укажіть похідну функції \ny = (4/3)x⁶ + 7x³ − 5.',
      'Укажіть похідну функції \nf(x) = x(x² + 3).',
      'Укажіть похідну функції \nf(x) = (3x + 1) / x.',
      'Тіло рухається прямолінійно за законом \ns(t) = (1/2)t³ − t² + 3t.\nВизначити прискорення його руху в момент часу t = 4 с.',
    ],
    },
    2: {
      class_id: 10,
      variant: 2,
      workType: 'Самостійна робота',
      title: 'Основні правила диференціювання функцій',
      tasks: [
      'Обчисліть значення функції \nf(x) = −4x³ − 3 в точці x₀ = −1.',
      'Знайдіть похідну функції \ny = −x + cos x.',
      'Укажіть похідну функції \ny = −2x³ + tg x.',
      'Укажіть похідну функції \ny = −(2/5)x⁵ − 3x⁴ + 12.',
      'Укажіть похідну функції \nf(x) = x(x⁴ − 2).',
      'Укажіть похідну функції \nf(x) = (−2x + 4) / x.',
      'Тіло рухається прямолінійно за законом \ns(t) = (1/3)t³ + 2t² + 2t.\nВизначити прискорення його руху в момент часу t = 6 с.',
    ],
    }
  }
};