import { ClassId, Variant, WorkItem } from '@/types';

export const works: Record<ClassId, Record<Variant, WorkItem>> = {
  6: {
    1: {
      class_id: 6,
      variant: 1,
      workType: 'Самостійна робота',
      title: 'Розкриття дужок та спрощення виразів',
      tasks: [
        '1. Розкрийте дужки та спростіть вираз: 4 + (−7x + 5)',
        '2. Розкрийте дужки та спростіть вираз: (6y − 8) + 7',
        '3. Розкрийте дужки та спростіть вираз: −d − (h + s − b)',
        '4. Розкрийте дужки та спростіть вираз: (7b − 4) − (4b + 2)',
        '5. Розкрийте дужки та спростіть вираз: −(5n + m) + (n + 8m) − (7m − 5n)',
        '6. Розкрийте дужки та спростіть вираз: 4 + (−7x + 5)',
        '7. Розкрийте дужки та спростіть вираз: −(y − a) + 7',
        '8. Розкрийте дужки та спростіть вираз: −d − (−h − s − b)',
        '9. Розкрийте дужки та спростіть вираз: (2a − 3) − (−a − 16)',
      ],
    },
    2: {
      class_id: 6,
      variant: 2,
      workType: 'Самостійна робота',
      title: 'Розкриття дужок та спрощення виразів',
      tasks: [
        '1. Розкрийте дужки та спростіть вираз: y − (−8 + 7y)',
        '2. Розкрийте дужки та спростіть вираз: −(2 − 5x) + 12',
        '3. Розкрийте дужки та спростіть вираз: c + (−x − p − 7c)',
        '4. Розкрийте дужки та спростіть вираз: (c − 5d) − (5c − d)',
        '5. Розкрийте дужки та спростіть вираз: (5x + y) − (−2y + 4x) + (7x − 3y)',
        '6. Розкрийте дужки та спростіть вираз: −(−x − 2) + (x − 1)',
        '7. Розкрийте дужки та спростіть вираз: y − (−8 + y)',
        '8. Розкрийте дужки та спростіть вираз: −(2 + 5x) − 12',
        '9. Розкрийте дужки та спростіть вираз: c + (x − p + 7c)',
      ],
    }
  },

  7: {
    1: {
      class_id: 7,
      variant: 1,
      workType: 'Самостійна робота',
      title: 'Лінійні рівняння та графіки функцій',
      tasks: [
        '1. Чи є розв’язком рівняння x − y = 5 пара чисел: (6;0), (7;2), (4;−1)?',
        '2. Графік якого з рівнянь проходить через точку A(3;−2): 2x − y = 6, 4x + 5y = 2, 3x − y = 5, 0,2x − 0,5y = −1,6',
        '3. Виразіть з рівняння x − 7y = 5 змінну x через y.',
        '4. Виразіть з рівняння 4x − y = 7 змінну y через x.',
        '5. Виразіть з рівняння 2x + 5y = 3 змінну x через y.',
        '6. Побудуйте графік функцій: x − y = 2 та 3x + y = 1.',
      ],
    },
    2: {
      class_id: 7,
      variant: 2,
      workType: 'Самостійна робота',
      title: 'Лінійні рівняння та графіки функцій',
      tasks: [
        '1. Чи є розв’язком рівняння x − y = 7 пара чисел: (8;1), (7;2), (4;−3)?',
        '2. Графік якого з рівнянь проходить через точку A(2;1): 2x − y = 6, 4x − 5y = 1, 3x − y = 5, 0,2x − 0,5y = −1,6',
        '3. Виразіть з рівняння x + 6y = 3 змінну x через y.',
        '4. Виразіть з рівняння 2x − y = 13 змінну y через x.',
        '5. Виразіть з рівняння 2x − 5y = 9 змінну x через y.',
        '6. Побудуйте графік функцій: x + y = −2 та 2x + y = 1.',
      ],
    }
  },

  10: {
    1: {
      class_id: 10,
      variant: 1,
      workType: 'Самостійна робота',
      title: 'Основні правила диференціювання функцій',
      tasks: [
        '1. Обчисліть значення функції f(x) = 3x^3 + 2 в точці x₀ = 1.',
        '2. Знайдіть похідну функції y = 3x − sinx.',
        '3. Укажіть похідну функції y = 3x^2 + tgx.',
        '4. Укажіть похідну функції y = (4/3)x^6 + 7x^3 − 5.',
        '5. Укажіть похідну функції f(x) = x(x^2 + 3).',
        '6. Укажіть похідну функції f(x) = (3x + 1) / x.',
        '7. Тіло рухається прямолінійно за законом s(t) = (1/2)t^3 − t^2 + 3t. Визначити прискорення його руху в момент часу t = 4 c.',
      ],
    },
    2: {
      class_id: 10,
      variant: 2,
      workType: 'Самостійна робота',
      title: 'Основні правила диференціювання функцій',
      tasks: [
        '1. Обчисліть значення функції f(x) = −4x^3 − 3 в точці x₀ = −1.',
        '2. Знайдіть похідну функції y = −x + cosx.',
        '3. Укажіть похідну функції y = −2x^3 + tgx.',
        '4. Укажіть похідну функції y = −(2/5)x^5 − 3x^4 + 12.',
        '5. Укажіть похідну функції f(x) = x(x^4 − 2).',
        '6. Укажіть похідну функції f(x) = (−2x + 4) / x.',
        '7. Тіло рухається прямолінійно за законом s(t) = (1/3)t^3 + 2t^2 + 2t. Визначити прискорення його руху в момент часу t = 6 c.',
      ],
    }
  }
};